cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'caskroom/drivers'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/binary'
tap 'nodenv/nodenv'

brew 'openssl'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'xquartz'

brew 'awscli'
brew 'coreutils'
brew 'cheat'
brew 'colordiff'
brew 'docker-clean'
brew 'dos2unix'
brew 'gist'
brew 'go'
brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'jq'
brew 'jsonpp'
brew 'libxslt'
brew 'libxml2'
brew 'mas'
brew 'mongodb', restart_service: :changed
brew 'most'
brew 'moreutils'
brew 'mysql', restart_service: :changed
brew 'node'
brew 'nodenv'
brew 'nodenv/nodenv/nodenv-package-rehash'
brew 'nodenv/nodenv/nodenv-default-packages'
brew 'openconnect'
brew 'pidof'
brew 'postgresql', restart_service: :changed
brew 'postgis'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'redis', restart_service: :changed
brew 'ripgrep'
brew 'ruby-build'
brew 'sl'
brew 'shellcheck'
brew 'svn'
brew 'tig'
brew 'tor', restart_service: :changed
brew 'tree'
brew 'reattach-to-user-namespace'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting' # antigen ?
brew 'watch'
brew 'md5sha1sum'
brew 'ssh-copy-id'
brew 'ec2-api-tools'
brew 'cowsay'
brew 'archey'
brew 'jsonpp'

cask 'google-chrome-beta' unless File.directory?("/Applications/Google Chrome.app")
cask 'slack' unless File.directory?("/Applications/Slack.app")
cask 'firefoxdeveloperedition'
cask 'docker'
cask 'atom'
cask 'iterm2'
cask 'sublime-text'
cask 'keepingyouawake'
cask 'vlc'
cask 'spotify'
cask 'dropbox'
cask 'the-unarchiver'